TexasInstruments/mcu_plus_sdk_am263x/examples/drivers/boot/sbl_qspi_enet/am263x-cc/r5fss0-0_nortos/example.syscfg
section1.load_memory                              = "MSRAM_VECS";
section1.group                                    = false;
section1.run_memory                               = "R5F_VECS";
section1.$name                                    = "Sbl Initialization Code";
section1.output_section.create(1);
section1.output_section[0].$name                  = ".sbl_init_code";
section1.output_section[0].input_section.create(1);
section1.output_section[0].input_section[0].$name = "*(.vectors). = align(8);";

section2.load_memory                  = "MSRAM_0";
section2.$name                        = "Text Segments";
section2.output_section.create(7);
section2.output_section[0].$name      = ".text";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text.hwi";
section2.output_section[1].palignment = true;
section2.output_section[2].$name      = ".text.cache";
section2.output_section[2].palignment = true;
section2.output_section[3].$name      = ".text.mpu";
section2.output_section[3].palignment = true;
section2.output_section[4].$name      = ".text.boot";
section2.output_section[4].palignment = true;
section2.output_section[5].$name      = ".data";
section2.output_section[5].palignment = true;
section2.output_section[6].$name      = ".rodata";
section2.output_section[6].palignment = true;

section3.load_memory                             = "MSRAM_0";
section3.group                                   = false;
section3.$name                                   = "Memory Segments";
section3.output_section.create(3);
section3.output_section[0].$name                 = ".bss";
section3.output_section[0].output_sections_start = "__BSS_START";
section3.output_section[0].output_sections_end   = "__BSS_END";
section3.output_section[0].palignment            = true;
section3.output_section[1].$name                 = ".sysmem";
section3.output_section[1].palignment            = true;
section3.output_section[2].$name                 = ".stack";
section3.output_section[2].palignment            = true;

section4.load_memory                              = "MSRAM_0";
section4.$name                                    = "Stack Segments";
section4.output_section.create(5);
section4.output_section[0].$name                  = ".irqstack";
section4.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section4.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section4.output_section[0].input_section.create(1);
section4.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section4.output_section[1].$name                  = ".fiqstack";
section4.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section4.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section4.output_section[1].input_section.create(1);
section4.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section4.output_section[2].$name                  = ".svcstack";
section4.output_section[2].output_sections_start  = "__SVC_STACK_START";
section4.output_section[2].output_sections_end    = "__SVC_STACK_END";
section4.output_section[2].input_section.create(1);
section4.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section4.output_section[3].$name                  = ".abortstack";
section4.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section4.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section4.output_section[3].input_section.create(1);
section4.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section4.output_section[4].$name                  = ".undefinedstack";
section4.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section4.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section4.output_section[4].input_section.create(1);
section4.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section5.$name                       = "NDK Packet Memory ENET CPPI DESC";
section5.type                        = "NOLOAD";
section5.group                       = false;
section5.load_memory                 = "CPPI_DESC";
section5.output_section.create(1);
section5.output_section[0].$name     = ".bss:ENET_CPPI_DESC";
section5.output_section[0].alignment = 128;

section6.type                    = "NOLOAD";
section6.group                   = false;
section6.load_memory             = "MSRAM_1";
section6.$name                   = "File Buffer to be flashed";
section6.output_section.create(1);
section6.output_section[0].$name = ".bss.filebuf";

section7.$name                   = "Scratch pad memory";
section7.type                    = "NOLOAD";
section7.group                   = false;
section7.load_memory             = "MSRAM_2";
section7.output_section.create(1);
section7.output_section[0].$name = ".bss.sbl_scratch";

section8.load_memory                  = "MSRAM_HSMRT";
section8.group                        = false;
section8.$name                        = "Hsmrt";
section8.output_section.create(1);
section8.output_section[0].$name      = ".rodata.hsmrt";
section8.output_section[0].palignment = true;

section9.type                        = "NOLOAD";
section9.group                       = false;
section9.$name                       = "SIPC HSM Queue Memory";
section9.load_memory                 = "MAILBOX_R5F";
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.sipc_hsm_queue_mem";
section9.output_section[0].alignment = 0;

section10.load_memory                 = "MAILBOX_R5F";
section10.type                        = "NOLOAD";
section10.group                       = false;
section10.$name                       = "SIPC R5F Queue Memory";
section10.output_section.create(1);
section10.output_section[0].alignment = 0;
section10.output_section[0].$name     = ".bss.sipc_r5f_queue_mem";

section11.load_memory                             = "MSRAM_ENET";
section11.$name                                   = "ENET Library Code";
section11.output_section.create(2);
section11.output_section[0].$name                 = ".text:enet";
section11.output_section[0].input_section.create(1);
section11.output_section[0].input_section[0].$name = "*enet*.lib<*>(.text)";
section11.output_section[1].$name                 = ".rodata:enet";
section11.output_section[1].input_section.create(1);
section11.output_section[1].input_section[0].$name = "*enet*.lib<*>(.rodata)";

enet_cpsw1.$name                        = "CONFIG_ENET_CPSW0";
enet_cpsw1.RtosVariant                  = "NoRTOS";
enet_cpsw1.LargePoolPktCount            = 16;
enet_cpsw1.macAddrConfig                = "Manual Entry";
enet_cpsw1.DisableMacPort2              = true;
enet_cpsw1.cptsHostRxTsEn               = false;
enet_cpsw1.MDIO.$assign                 = "MDIO";
enet_cpsw1.RGMII1.$assign               = "RGMII1";
enet_cpsw1.txDmaChannel[0].$name        = "ENET_DMA_TX_CH0";
enet_cpsw1.txDmaChannel[0].PacketsCount = 8;
enet_cpsw1.rxDmaChannel[0].$name        = "ENET_DMA_RX_CH0";
enet_cpsw1.rxDmaChannel[0].PacketsCount = 8;

const ethphy_cpsw_icssg  = scripting.addModule("/board/ethphy_cpsw_icssg/ethphy_cpsw_icssg", {}, false);
const ethphy_cpsw_icssg1 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg1.$name = "CONFIG_ENET_ETHPHY0";
enet_cpsw1.ethphy1       = ethphy_cpsw_icssg1;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.peripheralDriver.QSPI.$suggestSolution           = "QSPI";
flash1.peripheralDriver.QSPI.QSPI_D0.$suggestSolution   = "QSPI_D0";
flash1.peripheralDriver.QSPI.QSPI_D1.$suggestSolution   = "QSPI_D1";
flash1.peripheralDriver.QSPI.QSPI_D2.$suggestSolution   = "QSPI_D2";
flash1.peripheralDriver.QSPI.QSPI_D3.$suggestSolution   = "QSPI_D3";
flash1.peripheralDriver.QSPI.QSPI_CLK.$suggestSolution  = "QSPI_CLK";
flash1.peripheralDriver.QSPI.QSPI_CSn0.$suggestSolution = "QSPI_CSn0";
i2c1.I2C.SDA.$suggestSolution                           = "UART0_CTSn";
debug_log.uartLog.UART.$suggestSolution                 = "UART0";
enet_cpsw1.MDIO.MDIO_MDIO.$suggestSolution              = "MDIO_MDIO";
enet_cpsw1.MDIO.MDIO_MDC.$suggestSolution               = "MDIO_MDC";
enet_cpsw1.RGMII1.RD0.$suggestSolution                  = "RGMII1_RD0";
enet_cpsw1.RGMII1.RD1.$suggestSolution                  = "RGMII1_RD1";
enet_cpsw1.RGMII1.RD2.$suggestSolution                  = "RGMII1_RD2";
enet_cpsw1.RGMII1.RD3.$suggestSolution                  = "RGMII1_RD3";
enet_cpsw1.RGMII1.RX_CTL.$suggestSolution               = "RGMII1_RX_CTL";
enet_cpsw1.RGMII1.RXC.$suggestSolution                  = "RGMII1_RXC";
enet_cpsw1.RGMII1.TD0.$suggestSolution                  = "RGMII1_TD0";
enet_cpsw1.RGMII1.TD1.$suggestSolution                  = "RGMII1_TD1";
enet_cpsw1.RGMII1.TD2.$suggestSolution                  = "RGMII1_TD2";
enet_cpsw1.RGMII1.TD3.$suggestSolution                  = "RGMII1_TD3";
enet_cpsw1.RGMII1.TX_CTL.$suggestSolution               = "RGMII1_TX_CTL";
enet_cpsw1.RGMII1.TXC.$suggestSolution                  = "RGMII1_TXC";
